In [15]:
%pylab inline
import pandas
import seaborn

Populating the interactive namespace from numpy and matplotlib

# Load txt file into memory

In [16]:
data = pandas.read_csv('/home/pedro/dev/datascience/data_science_env/Projects/uber-raw-data-apr14.txt')
df = pandas.DataFrame(data=data)

In [17]:
df.tail()

                 Date/Time      Lat      Lon    Base
564511  4/30/2014 23:22:00  40.7640 -73.9744  B02764
564512  4/30/2014 23:26:00  40.7629 -73.9672  B02764
564513  4/30/2014 23:31:00  40.7443 -73.9889  B02764
564514  4/30/2014 23:32:00  40.6756 -73.9405  B02764
564515  4/30/2014 23:48:00  40.6880 -73.9608  B02764

# Convert datetime and add some useful columns

In [18]:
df['Date/Time'] = df['Date/Time'].map(pandas.to_datetime)

In [19]:
# df.drop('Date/Time', axis=1)
df.head()

            Date/Time      Lat      Lon    Base
0 2014-04-01 00:11:00  40.7690 -73.9549  B02512
1 2014-04-01 00:17:00  40.7267 -74.0345  B02512
2 2014-04-01 00:21:00  40.7316 -73.9873  B02512
3 2014-04-01 00:28:00  40.7588 -73.9776  B02512
4 2014-04-01 00:33:00  40.7594 -73.9722  B02512